[
    {
        "riddle": "एक थाली में है चार बटन, चारों बटन अलग रंग के, एक बटन उठा लिया तो कितने बटन बचे?",
        "answer": "तीन बटन"
    },
    {
        "riddle": "ऊपर से आया, नीचे को गया, जो इसे देखे वो मर गया। बताओ क्या है?", 
        "answer": "नारियल"
    },
    {
        "riddle": "चार अक्षर का मेरा नाम, उल्टा-सीधा एक समान। बताओ मैं कौन हूं?",
        "answer": "नयन"
    },
    {
        "riddle": "एक राजा की दो रानियां, दोनों के दो-दो नाम। एक साथ रहती हैं, पर मिलती नहीं कभी। बताइए क्या हैं?",
        "answer": "आंखें"
    },
    {
        "riddle": "बिना पैर चलता जाए, बिना मुंह खाता जाए। क्या है वो?",
        "answer": "समय"
    },
    {
        "riddle": "लाल रंग की एक इमारत, दरवाजा नहीं खिड़की नहीं, फिर भी अंदर बैठे हैं 32 सिपाही। बताओ क्या है?",
        "answer": "मुंह"
    },
    {
        "riddle": "जब तक जिंदा, तब तक रोता। मर गया तो खूब हंसता। क्या है वो?",
        "answer": "बादल"
    },
    {
        "riddle": "दिन को सोता, रात को जागता, चांद को देख कर गाता। बताओ कौन है?",
        "answer": "उल्लू"
    },
    {
        "riddle": "पानी में रहूं, पानी पीऊं नहीं, बिना पानी के मर जाऊं। बताओ मैं कौन हूं?",
        "answer": "मछली"
    },
    {
        "riddle": "हरा होकर पीला पड़ूं, पीला होकर काला पड़ूं, काला होकर लाल हो जाऊं। बताओ मैं क्या हूं?",
        "answer": "मिर्च"
    },
    {
        "riddle": "लंबा है पर पेड़ नहीं, पूंछ है पर जानवर नहीं, जहर है पर सांप नहीं। बताओ क्या है?",
        "answer": "धुआं"
    },
    {
        "riddle": "एक किला है सफेद, उसमें है लाल सिपाही, जब वो निकलते हैं बाहर, तो सब डरते हैं भाई। बताओ क्या है?",
        "answer": "दांत"
    },
    {
        "riddle": "खुद तो काला, पर सबको सफेद बनाता। क्या है वो?",
        "answer": "साबुन"
    },
    {
        "riddle": "चार भाई एक साथ चलते, पर एक दूसरे को छू नहीं सकते। क्या हैं वो?",
        "answer": "पहिए"
    },
    {
        "riddle": "जब भी देखो तब ये चलती, फिर भी एक जगह खड़ी रहती। क्या है वो?",
        "answer": "घड़ी"
    },
    {
        "riddle": "बिना हाथ के चित्र बनाए, बिना पैर के चल जाए। क्या है वो?",
        "answer": "समय"
    },
    {
        "riddle": "एक छोटी सी किरिया, लाखों का काम करे। बताओ क्या है?",
        "answer": "कलम"
    },
    {
        "riddle": "जितना खाए उतना बढ़े, पानी पीए मर जाए। क्या है वो?",
        "answer": "आग"
    },
    {
        "riddle": "दिन में सोए, रात में जागे, उल्टा चले सो भी आगे। क्या है?",
        "answer": "चमगादड़"
    },
    {
        "riddle": "एक थाल मोती से भरा, सबके सिर पर औंधा धरा। क्या है वो?",
        "answer": "आसमान में तारे"
    },
    {
        "riddle": "एक अजब गजब का पेड़, जिसकी डाली पर तीस पत्ते, हर पत्ते के दो रंग। क्या है वो?",
        "answer": "कैलेंडर"
    },
    {
        "riddle": "छोटी सी डिबिया, रंग बिरंगी चिड़िया। क्या है?",
        "answer": "मोबाइल"
    },
    {
        "riddle": "बिना मुंह बोले, बिना कान सुने, सबकी खबर रखे। क्या है?",
        "answer": "अखबार"
    },
    {
        "riddle": "जब तक रहता जिंदा, करता रहता है धंधा, मरने के बाद भी साथ निभाता, लोगों को रोशनी दिखाता। क्या है?",
        "answer": "मोमबत्ती"
    },
    {
        "riddle": "एक राजा ने महल बनवाया, उसमें एक भी दरवाजा नहीं लगवाया। क्या है वो?",
        "answer": "अंडा"
    },
    {
        "riddle": "सफेद चादर पर काली दवात, पढ़े जो कोई वो हो जाए मात। क्या है?",
        "answer": "किताब"
    },
    {
        "riddle": "बिना पंख उड़ जाऊं, बिना आंख रो जाऊं, बिना पैर दौड़ जाऊं। क्या हूं?",
        "answer": "बादल"
    },
    {
        "riddle": "एक थाली में दो पूड़ी, एक गीली एक सूखी। क्या है?",
        "answer": "चांद और सूरज"
    },
    {
        "riddle": "लाल किले में सफेद किरिया, काली किरिया के बीच में। क्या है?",
        "answer": "दांत और जीभ"
    },
    {
        "riddle": "हरी डंडी लाल फूल, उसमें निकले सफेद रूई। क्या है?",
        "answer": "मूली"
    },
    {
        "riddle": "चलते-चलते थक जाऊं, खड़े-खड़े सो जाऊं, लेकिन बैठता नहीं। बताओ मैं कौन हूं?",
        "answer": "झाड़ू"
    },
    {
        "riddle": "बिना खाए मोटा होता जाए, खाना खाए तो पतला हो जाए। क्या है वो?",
        "answer": "तकिया"
    },
    {
        "riddle": "जब छोटा था तो लाल था, जब बड़ा हुआ तो हरा हो गया, जब मर गया तो काला हो गया। क्या है?",
        "answer": "मिर्ची"
    },
    {
        "riddle": "दिन भर करे काम, रात को आराम, सुबह भी गायब हो जाए। क्या है?",
        "answer": "सितारे"
    },
    {
        "riddle": "एक डिब्बा चमचमाता, खोलो तो मुंह में पानी आता। क्या है?",
        "answer": "आइसक्रीम"
    },
    {
        "riddle": "छोटी सी नाव में सैकड़ों यात्री, कोई भी डूबता नहीं। क्या है?",
        "answer": "तरबूज के बीज"
    },
    {
        "riddle": "बिना हाथ के ताली बजाए, बिना पैर के नाचे गाए। क्या है?",
        "answer": "लहरें"
    },
    {
        "riddle": "जितना गरम करो उतना ठंडा हो जाए, जितना ठंडा करो उतना गरम हो जाए। क्या है?",
        "answer": "थर्मस"
    },
    {
        "riddle": "पहले था काला, फिर हुआ सफेद, अब है रंग-बिरंगा। क्या है?",
        "answer": "टेलीविजन"
    },
    {
        "riddle": "दिन में एक बार, रात में दो बार, महीने में एक बार भी नहीं। क्या है?",
        "answer": "द अक्षर"
    },
    {
        "riddle": "ऊपर से काला, अंदर से लाल, खाने में मीठा, बीज निकाल। क्या है?",
        "answer": "जामुन"
    },
    {
        "riddle": "बिना पैर के दौड़े, बिना पंख के उड़े, बिना आंख के रोए। क्या है?",
        "answer": "हवा"
    },
    {
        "riddle": "जब तक जिंदा रहता है खड़ा रहता है, मरते ही लेट जाता है। क्या है?",
        "answer": "पेड़"
    },
    {
        "riddle": "एक कमरे में सौ मेहमान, सबके सिर पर टोपी एक समान। क्या है?",
        "answer": "माचिस की तीलियां"
    },
    {
        "riddle": "दिन को भागे, रात को जागे, चोर देखकर शोर मचाए। क्या है?",
        "answer": "कुत्ता"
    },
    {
        "riddle": "खुद को तोड़े, दूसरों को जोड़े। क्या है?",
        "answer": "सुई धागा"
    },
    {
        "riddle": "पहले हरा, फिर पीला, फिर लाल, खाने में मीठा, देखने में लाल। क्या है?",
        "answer": "पपीता"
    },
    {
        "riddle": "चलते-चलते रुक जाए, रुकते ही चल पड़े। क्या है?",
        "answer": "घड़ी"
    },
    {
        "riddle": "एक राजा की दो रानियां, एक सोती एक जागती। क्या है?",
        "answer": "जूते"
    },
    {
        "riddle": "बिना डोर के बंधा रहे, बिना पंख के उड़ता रहे। क्या है?",
        "answer": "विचार"
    },
    {
        "riddle": "जितना खोलो उतना कसे, जितना कसो उतना खुले। क्या है?",
        "answer": "कैंची"
    },
    {
        "riddle": "दिन भर काम करे, रात को विश्राम करे, सुबह फिर तैयार खड़ा। क्या है?",
        "answer": "दरवाजा"
    },
    {
        "riddle": "एक थाल में चार दीये, चारों जले एक समान। क्या है?",
        "answer": "गाय के थन"
    },
    {
        "riddle": "छोटी सी चिड़िया करे पुकार, सारी दुनिया करे विचार। क्या है?",
        "answer": "मोबाइल की घंटी"
    },
    {
        "riddle": "बिना बोले बात करे, बिना कान के सुन ले। क्या है?",
        "answer": "मोबाइल मैसेज"
    },
    {
        "riddle": "आगे चले तो पीछे जाए, पीछे चले तो आगे जाए। क्या है?",
        "answer": "कोहनी"
    },
    {
        "riddle": "एक कमरा बहुत बड़ा, उसमें एक भी खिड़की नहीं। क्या है?",
        "answer": "दिल"
    },
    {
        "riddle": "सफेद घर में हरी बत्ती, खाने में मीठी लगती। क्या है?",
        "answer": "नारियल"
    },
    {
        "riddle": "चार भाई एक साथ रहें, एक दूसरे को कभी न मिलें। क्या है?",
        "answer": "मेज के पाए"
    },
    {
        "riddle": "जब गिरे तब हंसे, जब उठे तब रोए। क्या है?",
        "answer": "बारिश"
    },
    {
        "riddle": "एक राजा ने बनवाया तालाब, उसमें न पानी न मछली। क्या है?",
        "answer": "नाभि"
    },
    {
        "riddle": "दिन को सोए रात को खाए, उलटा लटक कर मजा उड़ाए। क्या है?",
        "answer": "चमगादड़"
    },
    {
        "riddle": "बिना जीभ के बोले, बिना कान के सुने। क्या है?",
        "answer": "कंप्यूटर"
    },
    {
        "riddle": "एक पहाड़ी पर दो कुएं, दोनों में पानी एक समान। क्या है?",
        "answer": "नाक"
    },
    {
        "riddle": "लाल रंग की एक कटोरी, उसमें काली दाल। क्या है?",
        "answer": "तरबूज"
    },
    {
        "riddle": "बिना पानी के तैरे, बिना पंख के उड़े। क्या है?",
        "answer": "बादल"
    },
    {
        "riddle": "एक थाली में दो पकवान, एक गरम और एक ठंडा। क्या है?",
        "answer": "जीभ"
    },
    {
        "riddle": "दिन में एक बार, रात में दो बार, साल में एक बार भी नहीं। क्या है?",
        "answer": "'न' अक्षर"
    },
    {
        "riddle": "खुद जले दूसरों को रोशनी दे। क्या है?",
        "answer": "दीया"
    },
    {
        "riddle": "जब तक जिंदा तब तक खड़ा, मरते ही गिर पड़ा। क्या है?",
        "answer": "बाल"
    },
    {
        "riddle": "एक छड़ी लंबी डोरी, जहां चाहे वहां मोड़ी। क्या है?",
        "answer": "रस्सी"
    },
    {
        "riddle": "बिना हाथ के पकड़े, बिना पैर के चले। क्या है?",
        "answer": "घड़ी"
    },
    {
        "riddle": "एक राजा की दो रानियां, दोनों एक दूसरे की बहनें। क्या है?",
        "answer": "जुड़वां बहनें"
    },
    {
        "riddle": "लंबा है पर रस्सी नहीं, पूंछ है पर चूहा नहीं। क्या है?",
        "answer": "कोमा"
    },
    {
        "riddle": "जब भी देखो तब ये चलती, फिर भी एक जगह खड़ी रहती। क्या है?",
        "answer": "पंखा"
    },
    {
        "riddle": "बिना बीज का पेड़, बिना पत्ते की डाल। क्या है?",
        "answer": "हाथ"
    },
    {
        "riddle": "एक कमरे में सौ दरवाजे, सब खुले पर दिखें नहीं। क्या है?",
        "answer": "जाली"
    },
    {
        "riddle": "दिन को काला, रात को उजाला। क्या है?",
        "answer": "आकाश"
    },
    {
        "riddle": "बिना पैर के चलूं, बिना आंख के देखूं। क्या है?",
        "answer": "घड़ी"
    },
    {
        "riddle": "एक थाल मोती से भरा, सबके सिर पर औंधा धरा। क्या है?",
        "answer": "तारे"
    },
    {
        "riddle": "जब जन्म लिया तब काला था, जब जवान हुआ तब लाल हुआ, बुढ़ापे में सफेद हो गया। क्या है?",
        "answer": "बाल"
    },
    {
        "riddle": "चार कोने, चार कान, बीच में है मैदान। क्या है?",
        "answer": "चौक"
    },
    {
        "riddle": "आधा लाल आधा हरा, बीच में काला। क्या है?",
        "answer": "तरबूज"
    },
    {
        "riddle": "एक कटोरी में दो रंग की दाल। क्या है?",
        "answer": "अंडा"
    },
    {
        "riddle": "बिना मुंह के खाए, बिना पेट के पचाए। क्या है?",
        "answer": "आग"
    },
    {
        "riddle": "दिन को सोए रात को जागे, चांद देख कर नाचे गाए। क्या है?",
        "answer": "जुगनू"
    },
    {
        "riddle": "एक राजा की सौ रानियां, सब एक रंग की। क्या है?",
        "answer": "केले"
    },
    {
        "riddle": "छोटी सी किरिया, लाखों का काम करे। क्या है?",
        "answer": "बिजली"
    },
    {
        "riddle": "हरी चादर लाल फूल, काला बीज सफेद रूई। क्या है?",
        "answer": "तरबूज"
    },
    {
        "riddle": "बिना पंख का पंछी, बिना मुंह का गवैया। क्या है?",
        "answer": "बांसुरी"
    },
    {
        "riddle": "एक थाल में चार कटोरी, चारों में एक ही चीज। क्या है?",
        "answer": "नारियल"
    },
    {
        "riddle": "जब तक जिंदा तब तक खाए, मरने पर सबको खिलाए। क्या है?",
        "answer": "पेड़"
    },
    {
        "riddle": "ऊपर नीचे दो भाई, कभी ना मिलें सगाई। क्या है?",
        "answer": "जूते"
    },
    {
        "riddle": "चार रानियाँ साथ में राजा, हर एक काम में उसका साझा।",
        "answer": "पैर"
    },
    {
        "riddle": "आने-जाने पर दु:ख देते हैं, बाक़ी समय आराम।",
        "answer": "सड़क"
    },
    {
        "riddle": "गिनती न हो सकती इनकी, बढ़ता जाए ये हर दिन।",
        "answer": "बुजुर्ग"
    },
    {
        "riddle": "एक ऐसी सुई जो बड़ी काम आए, भूले भटकों को रास्ता दिखाए।",
        "answer": "कंपास"
    },
    {
        "riddle": "पानी जब ऊपर से बरसे तो मैं खुल जाता हूँ, बच्चे बूढ़े सभी के बहुत काम आता हूँ।",
        "answer": "छाता"
    },
    {
        "riddle": "हरा-हरा आटा लाए, उससे लाल परांठा बनाएं।",
        "answer": "मेहंदी"
    },
    {
        "riddle": "सात रंगों की एक रज़ाई, बारिश ओढ़ के साथ में लाई।",
        "answer": "इंद्रधनुष"
    },
    {
        "riddle": "बिना रंग का ऐसा फूल, सब्जी बनती कूल कूल।",
        "answer": "फूलगोभी"
    },
    {
        "riddle": "छोटा हूँ पर नाम बड़ा, दही की नदी में नहाता खड़ा।",
        "answer": "दही वडा"
    },
    {
        "riddle": "तीन अक्षर का मेरा नाम, उल्टा सीधा एक समान।",
        "answer": "जहाज़"
    }
]



